export const generateYears = (start: number, end: number): string[] => {
    return Array.from({ length: end - start + 1 }, (_, index) =>
      (start + index).toString()
    );
  };
  
  export const years = generateYears(1990, 2025);
  
  export const getDaysInMonth = (month: number, year: number): string[] => {
    const daysInMonth = new Date(year, month, 0).getDate(); // Последний день месяца
    return Array.from({ length: daysInMonth }, (_, index) => (index + 1).toString());
  };
  
  export const months = [
    "Январь",
    "Февраль",
    "Март",
    "Апрель",
    "Май",
    "Июнь",
    "Июль",
    "Август",
    "Сентябрь",
    "Октябрь",
    "Ноябрь",
    "Декабрь",
  ];
  
  export const countries = [
    "Россия",
    "Казахстан",
    "Кыргызстан",
    "Узбекистан",
    "Таджикистан",
    "Беларусь",
    "Украина",
    "Грузия",
    "Армения",
    "Азербайджан",
    "Молдова",
    "Туркмения",
    "Эстония",
    "Латвия",
    "Литва",
    "Германия",
    "Франция",
    "США",
    "Китай",
    "Япония",
  ];
  export const citiesByCountry: Record<string, string[]> = {
    Россия: ["Москва", "Санкт-Петербург", "Казань", "Екатеринбург", "Новосибирск"],
    Казахстан: ["Алматы", "Астана", "Шымкент", "Караганда", "Атырау"],
    Кыргызстан: ["Бишкек", "Ош", "Джалал-Абад", "Каракол", "Талас"],
    Узбекистан: ["Ташкент", "Самарканд", "Бухара", "Наманган", "Андижан"],
    Таджикистан: ["Душанбе", "Худжанд", "Бохтар", "Куляб", "Истаравшан"],
    Беларусь: ["Минск", "Гомель", "Могилев", "Брест", "Гродно"],
    Украина: ["Киев", "Одесса", "Харьков", "Львов", "Днепр"],
    США: ["Нью-Йорк", "Лос-Анджелес", "Чикаго", "Хьюстон", "Сан-Франциско"],
    Германия: ["Берлин", "Мюнхен", "Франкфурт", "Гамбург", "Кёльн"],
  };
  