import { FC } from "react";
import scss from "./MasterClass.module.scss";

const AllMasterClass: FC = () => {
  return (
    <section className={scss.MasterClass}>
      <div className="container">
        <h1>Мастер Kлассы</h1>
        <div className={scss.content}>
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>{" "}
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>{" "}
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>{" "}
          <div className={scss.block}>
            <h4>
              Реактивное программирование на Java: как, зачем и стоит ли?{" "}
            </h4>
            <p>
              Программирования появилась сравнительно недавно, лет 10 назад. Что
              вызвало популярность этого относительно нового подхода и почему
              сейчас он в тренде, рассказал на конференции РИТ++ ...
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default AllMasterClass;
