import React from "react";
import scss from "@/components/pages/Home/SectionHome4.module.scss";

import Image from "next/image";
import img_home4 from "@/assets/home4_img.png";

const questions = [
  {
    question: "Что такое зарезервированные слова в программировании?",
    answer:
      "Онлайн-консультация — это простая и удобная возможность получить квалифицированную медицинскую помощь прямо из вашего дома. Просто выберите врача и обсудите свои вопросы через видеозвонок, чат или телефон. Мы здесь, чтобы помочь вам заботиться о вашем здоровье!",
  },
  {
    question: "Могу ли я отказаться от автопродления подписки?",
    answer:
      "Онлайн-консультации по видео могут проводить разные специалисты: дерматолог, педиатр, гинеколог, терапевт и другие.",
  },
  {
    question: "Могу ли я вернуть деньги?",
    answer:
      "Как записаться к врачу по направлению через сайт Госуслуги. Перейдите в форму записи на приём, выберите направление, удобные дату и время, нажмите «Записаться» и дождитесь подтверждения.",
  },
  {
    question: "Какие направление в IT самые актуальные?",
    answer:
      "Выслушивает жалобы пациента, оценивает состояние кожи, заполняет медицинскую карту и составляет программу назначений.",
  },
  {
    question: "Платформа обнавляется?",
    answer:
      "Выслушиваются жалобы пациента, оценивается состояние кожи, заполняется медицинская карта, составляется программа назначений, даются рекомендации по уходу.",
  },
  {
    question:
      "Нужно ли учить другой язык программирования, перед изучением языка С++?",
    answer:
      "Медицинская карта содержит персональные и медицинские данные пациента, включая информацию о лечении и состоянии здоровья.",
  },
  {
    question: "Как я могу получить доступ ка всем курсом?",
    answer:
      "Медицинская карта содержит персональные и медицинские данные, которые тщательно защищены и конфиденциальны.",
  },
];

const SectionHome4 = () => {
  return (
    <div id={scss.answer1}>
      {questions ? (
        <>
          <div className="container">
            <div className={scss.answer1}>
              <div className={scss.answer1_text}>
              <h2>Остались вопросы?</h2>
              <Image src={img_home4} alt="img" />
              </div>
         

            <div className={scss.answer}>
              {questions?.map((el, index) => (
                <details key={index}>
                  <summary>{el.question}</summary>
                  <p>{el.answer}</p>
                </details>
              ))}
            </div>
            </div>

           
          </div>
        </>
      ) : (
        <></>
      )}
    </div>
  );
};

export default SectionHome4;
